cases/old/teste-2d-fsi-oa-on/fluid/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| teste-2d-fsi-oa-on -- velocity field do fluido (lumen)                       |
| Inlet/outlet pressureInletOutletVelocity (deixa U vir do gradiente de p).    |
| wall_bot/wall_top noSlip (parede arterial nao escorrega).                    |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inlet
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
    }
    wall_bot
    {
        type            noSlip;
    }
    wall_top
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
