cases/old/teste-2d-fsi-oa-on/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          6;
        startFace       434;
    }
    outlet
    {
        type            patch;
        nFaces          6;
        startFace       440;
    }
    wall_bot
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       446;
    }
    wall_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       486;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          480;
        startFace       526;
    }
)

// ************************************************************************* //
