cases/old/teste-2d-fsi-oa-on/fluid/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// Sangue Newtoniano ~37 C: rho = 1050 kg/m^3, nu = 3.5e-6 m^2/s
// (mu = rho * nu = 3.675e-3 Pa.s). Idem ao-mestrado.

transportModel  Newtonian;

nu              nu [0 2 -1 0 0 0 0] 3.5e-6;
